[
  {
    "name": "Liar's Dice",
    "thumbnail": "liarsdice_thumbnail.png",
    "screenshot": "liarsdice_screenshot.png",
    "shortDesc": "Cryptographically fair dice game, entry to Hack the North 2015",
    "description": [
      "Liar's Dice is a fun dice game most famous for a minute-long scene in Pirates of the Caribbean: Dead Man's Chest. After doing some reading about mental poker, I devised a commitment protocol that would allow Liar's Dice to be played without a trusted server managing the dice rolling.",
      "Originally, I implemented my protocol in the form of a simple command-line Python app. At Hack the North, I rewrote the entire app with a far more usable JavaScript frontend.",
      "The server uses Python and Redis and is currently running on Google Cloud Platform. By a back-of-an-envelope calculation, the server should support at least 1500 concurrent users with a single server. The implementation also supports multiple servers.",
      "You can play Liar's Dice at <a href='http://liarsdice.co'>liarsdice.co</a>, view the source code on <a href='https://github.com/Semicolon314/liars-dice'>GitHub</a>, or take a look at the <a href='http://devpost.com/software/liars-dice'>DevPost</a> submission."
    ],
    "language": "Python",
    "date": "September 2015"
  },
  {
    "name": "Fortuit",
    "thumbnail": "fortuit_thumbnail.png",
    "screenshot": "fortuit_screenshot.png",
    "shortDesc": "Prediction tracker, entry to PennApps Winter 2015.",
    "description": [
      "Fortuit is inspired by something called overconfidence bias: when we make predictions about the future, we tend to be really optimistic. More generally, it's hard to make numerically precise predictions: we overestimate and underestimate by large margins.",
      "Fortuit aims to improve prediction-making by letting you track your predictions. This gives you the benefit of hindsight, and you can use the quantified analysis of your predictions to improve your predictions in the future.",
      "Though it didn't win any prizes at PennApps, I'm really happy with the way it turned out. The interface is sleek and it works great on mobile.",
      "You can try it out at <a href='http://fortuit.tk'>fortuit.tk</a>, view the source code on <a href='https://github.com/Semicolon314/fortuit'>GitHub</a>, or take a look at the <a href='http://devpost.com/software/fortuit'>DevPost</a> submission."
    ],
    "language": "MEAN Stack",
    "date": "January 2015"
  },
  {
    "name": "Botscape",
    "thumbnail": "botscape_thumbnail.png",
    "screenshot": "botscape_screenshot.png",
    "shortDesc": "Winning AI-based entry to Hack the North 2014.",
    "description": [
      "At the first ever Hack the North in September 2014, my teammates and I decided to take the idea of an Arificial Intelligence challenge further than it has ever been taken before.",
      "Over the course of 36 hours, we created a massively-multiplayer online game... for robots. Players of Botscape would write programs to collect resources and fight other bots for dominance.",
      "Programming challenges like these are a fun way to practice your coding skills while satisfying your competitive drive.",
      "Due to security and scalability issues, Botscape is not currently available for play online. However, you can check out Botscape on <a href='http://devpost.com/software/botscape'>DevPost</a> or watch the <a href='https://www.youtube.com/watch?v=b_m1uPYl8UM'>presentation I gave at Hack the North</a>."
    ],
    "language": "Node.js",
    "date": "September 2014"
  },
  {
    "name": "Mafia",
    "thumbnail": "mafia_thumbnail.png",
    "screenshot": "mafia_screenshot.png",
    "shortDesc": "A simple webapp for the party game.",
    "description": [
      "Mafia is a popular party game. A small number of players are the mafia, and their goal is to eliminate all other players. The rest of the players are villagers, who want to lynch the mafia, but they don't know who the mafia are. There are a few special villager roles as well.",
      "The mafia anonymously assassinate one villager each night. This requires one of the players to be a game master to manage player interactions, and the game master can't participate in the game.",
      "I created a simple, minimalistic web app that takes the place of the game master. It still requires one of the players to be the moderator, but the moderator can play like any other player.",
      "There are existing websites that do this, but they overcomplicate the rules to faciliate different variations. Additionally, not requiring accounts is a huge boon to adoptance.",
      "The web app can also be used to play over the internet when paired with an external communication platform, like Skype or Google Hangouts.",
      "You can view the source code for Mafia (and run your own server) on <a href='https://github.com/Semicolon314/mafia'>GitHub</a>."
    ],
    "language": "Node.js",
    "date": "November 2014"
  },
  {
    "name": "Spleef AI Challenge",
    "thumbnail": "spleefai_thumbnail.png",
    "screenshot": "spleefai_screenshot.png",
    "shortDesc": "Inspired by the UW Computer Science club AI challenges.",
    "description": [
      "In 2011, I participated in the <a href='http://ants.aichallenge.org/'>Ants AI Challenge</a>, run by the University of Waterloo's Computer Science club.",
      "I eagerly awaited the next AI challenge, but it never came. In my last year of high school, I took matters into my own hands, and created Spleef AI Challenge along with several friends.",
      "We attempted to design the challenge at the level of high school students. However, we overshot the difficulty level; the game has a large branching factor and games can be hundreds of turns long.",
      "Spleef AI Challenge is based on the Minecraft minigame Spleef, in which players attempt to break the blocks under other players' feet and try to be the last one standing on the platform. Our implementation also has the tiebreaking condition that if nobody can reach each other, the player with the largest accessible area wins.",
      "The fairly simple rules result in some surprisingly emergent gameplay, as bots try to balance claiming territory with safety.",
      "Unfortunately, Spleef Challenge is no longer running."
    ],
    "language": "Python",
    "date": "March 2014"
  },
  {
    "name": "Depnunkei",
    "thumbnail": "depnunkei_thumbnail.png",
    "screenshot": "depnunkei_screenshot.png",
    "shortDesc": "Stock trading game with randomized stocks.",
    "description": [
      "The computer science club at my school ran a two-week long idle game challenge. An idle game is a game in which most of your time is spent waiting; a common example is Cookie Clicker.",
      "My project was Depnunkei, a stock-trading game written in HTML5 and JavaScript. The stocks are unique and randomly generated each game, and more enter the market as stocks go bankrupt.",
      "Try playing <a href='/depnunkei'>Depnunkei</a> and see how much money you can make. You can also view the source code on <a href='https://github.com/Semicolon314/Depnunkei'>GitHub</a>."
    ],
    "language": "JavaScript",
    "date": "January 2014"
  },
  {
    "name": "Condi",
    "thumbnail": "condi_thumbnail.png",
    "screenshot": "condi_screenshot.png",
    "shortDesc": "A simple roguelike made for a casual 7DRL.",
    "description": [
      "Condi was my entry to a casual 7DRL (7-day roguelike) with some friends. A roguelike is a text-based game which usually involved exploring a dungeon and fighting monsters.",
      "Condi features random dungeon generation, randomly generated items with special effects, and absolutely no balance. The dungeons gradually get harder as your character gains levels.",
      "You can view the source code for Condi on <a href='https://github.com/Semicolon314/Condi'>GitHub</a>."
    ],
    "language": "Java",
    "date": "September 2012"
  }
]
